tap "anomalyco/tap"
tap "asmvik/formulae"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Pyright fork with various improvements and built-in pylance features
brew "basedpyright"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Language Server for the Lua language
brew "lua-language-server"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Static type checker for Python
brew "pyright"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Tool to impose load on and stress test a computer system
brew "stress"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Simple hotkey-daemon for macOS.
brew "asmvik/formulae/skhd"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
cask "font-sf-mono-nerd-font-ligaturized"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Adaptive brightness for external displays
cask "lunar"
# Clipboard manager
cask "maccy"
# Web development solution with Apache, Nginx, PHP & MySQL
cask "mamp"
# Unpacks archive files
cask "the-unarchiver"
